sdaiAccessModel(Sdai_instS*,SdaiAccessMode)
\details
Opens a specified model in a specified mode.
\param model  [in] A model to be open.
\param mode   [in] An access mode.
\returns A pointer to the open model if the function successfully opened the model; otherwise, the function returns the NULL value.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NEXS - Transaction does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMX_RO - SDAI-model access read-only.
* sdaiMX_RW - SDAI-model access read-write.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSession session = sdaiOpenSession();
SdaiRep repo = sdaiOpenRepositoryBN(session, "test_repository");
SdaiModel model = sdaiCreateModelBN(repo, "default", "ifc4");
...
model = sdaiAccessModel(model, sdaiRW);
...
SdaiAppInstance ifcCircleProfileDef = sdaiCreateInstanceBN(model, "ifccircleprofiledef");